[
  {
    "id": 1,
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/05/Facebook_Logo_%282019%29.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook is one of the world’s most widely used social networking apps, designed to help people connect, share, and communicate with others across the globe. It allows users to create personal profiles, post updates, photos, and videos, and engage through comments, likes, and reactions. With its powerful algorithm, Facebook tailors each user’s feed to display relevant stories, trending topics, and community updates.\n\nBeyond personal connections, Facebook serves as a platform for businesses, creators, and organizations. Pages, groups, and events help people build communities, promote causes, or market products. The integrated Messenger app enables instant communication through text, voice, and video calls. Facebook Marketplace also provides a simple way to buy and sell items locally.\n\nWith a focus on accessibility, privacy, and customization, Facebook continues to evolve as an all-in-one hub for social interaction, entertainment, and digital connection. Whether you’re keeping up with loved ones or managing a brand, Facebook keeps the world just one tap away.",
    "size": 85,
    "reviews": "955M",
    "ratingAvg": 4.2,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 7000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 46400000 }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co.com/tpsHsVHr/youtube.webp",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is the world’s leading platform for video content, empowering billions of users to watch, upload, and share videos on virtually any topic. From music videos and movie trailers to tutorials, documentaries, and vlogs, it caters to every kind of audience. The platform’s recommendation system personalizes each feed, making it easy to discover new creators and interests.\n\nCreators can build their own channels, gain subscribers, and monetize content through ads and memberships. Viewers, meanwhile, can engage by liking, commenting, and sharing. Features like offline downloads, background play, and YouTube Premium enhance the user experience even further.\n\nAs both an entertainment hub and a learning resource, YouTube connects cultures and communities worldwide. It’s not just a platform for watching videos—it’s a space for creativity, education, and global communication.",
    "size": 118,
    "reviews": "102M",
    "ratingAvg": 4.6,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 8000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 58000000 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/Q7rVG3VC/x-1.png",
    "title": "Twitter (X)",
    "companyName": "X Corp",
    "description": "X, formerly known as Twitter, is a fast-paced social platform built around real-time communication and trending conversations. It allows users to share short posts—called “tweets”—that can include text, images, videos, or links. The platform thrives on immediacy, enabling users to react to news, entertainment, and discussions as they unfold.\n\nPublic figures, journalists, and everyday users interact openly, making X a hub for dialogue and discovery. The platform’s algorithm curates a personalized timeline filled with updates from followed accounts and trending global topics. Features like reposts, replies, and hashtags make content spread quickly across audiences.\n\nWith the addition of X Premium, users gain access to longer posts, priority visibility, and enhanced tools for creators. Whether for networking, debate, or staying informed, X keeps the world connected in real time—one post at a time.",
    "size": 72,
    "reviews": "54M",
    "ratingAvg": 4.1,
    "downloads": "2B",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 20000000 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co.com/jPKn3CQY/instagram.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Instagram is a visual-focused social platform that lets users capture and share photos and videos with friends, followers, and the wider community. With features like Stories, Reels, and IGTV, Instagram encourages creativity and self-expression while keeping users engaged with dynamic content. Personalized feeds and Explore tabs help discover trending posts, new creators, and global moments.\n\nThe app supports direct messaging, collaborative posts, and interactive stickers, making communication seamless and fun. Businesses and influencers can promote brands, track analytics, and engage audiences through posts, ads, and partnerships.\n\nWhether sharing everyday moments or exploring creative trends, Instagram combines visual storytelling, social interaction, and community building into a simple, engaging platform that keeps users connected and inspired worldwide.",
    "size": 105,
    "reviews": "89M",
    "ratingAvg": 4.5,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 47000000 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co.com/HTqgz0QH/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "description": "Spotify is a music and podcast streaming app that gives users access to millions of tracks, playlists, and shows from around the world. With personalized recommendations, curated playlists, and mood-based mixes, Spotify helps you discover new music and stay updated with favorite artists. The platform supports offline listening, high-quality audio, and multi-device sync, so your music is always accessible.\n\nCreators, including artists and podcasters, can reach global audiences, monetize content, and track analytics to optimize engagement. Spotify’s social features allow users to share playlists, follow friends, and collaborate on music collections.\n\nWhether you’re exploring new genres, tuning into podcasts, or enjoying curated playlists, Spotify transforms the listening experience into a personal soundtrack that fits every mood, moment, and lifestyle.",
    "size": 62,
    "reviews": "74M",
    "ratingAvg": 4.7,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 51000000 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co.com/bp3bXnY/discord-1.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "description": "Discord is a versatile communication app that combines voice, video, and text chat into one unified platform. Originally popular among gamers, it has grown into a global space for study groups, communities, and professional teams. Users can join or create servers—organized spaces filled with topic-based channels for conversations, media sharing, and collaboration.\n\nThe app’s real-time voice channels let people talk freely without the need for formal calls, creating a relaxed and social atmosphere. Video calls, screen sharing, and integration with other tools make Discord ideal for both fun and productivity.\n\nCustom roles, permissions, and bots give users the ability to shape each server’s identity and experience. Whether for gaming, learning, or hosting events, Discord is a digital home where communities can gather, share ideas, and stay connected effortlessly.",
    "size": 90,
    "reviews": "42M",
    "ratingAvg": 4.6,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 1800000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 26000000 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co.com/tT039KV6/tiktok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "TikTok is a short-form video platform that has revolutionized online creativity and entertainment. Users can record, edit, and share videos ranging from 15 seconds to several minutes, enhanced with music, filters, and visual effects. Its AI-powered “For You” feed curates personalized content, ensuring that every user experiences a continuous stream of entertaining, inspiring, and educational videos.\n\nThe app empowers anyone to become a creator. Whether it’s dance challenges, comedy skits, DIY tutorials, or educational content, TikTok provides easy-to-use tools to produce high-quality videos. Users can interact with content through likes, comments, shares, duets, and stitches, creating a vibrant, participatory community.\n\nFor creators and brands, TikTok offers vast exposure and engagement opportunities. The platform’s trending challenges and algorithm-driven discoverability give even new users a chance to go viral. With its immersive, visually engaging format, TikTok isn’t just a social media app—it’s a global stage for creativity, connection, and cultural trends.",
    "size": 95,
    "reviews": "112M",
    "ratingAvg": 4.4,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 9000000 },
      { "name": "3 star", "count": 11000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 61000000 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co.com/WvqLNcxh/playstore.png",
    "title": "Google Play",
    "companyName": "Google LLC",
    "description": "Google Play Store is the official app marketplace for Android devices, providing users access to millions of apps, games, books, movies, and music. It serves as a secure, centralized platform where users can discover, download, and update content with ease. Advanced search and recommendation algorithms help users find apps suited to their needs, interests, and devices.\n\nDevelopers can reach global audiences through Google Play, promoting apps, tracking downloads, and analyzing user engagement. The store offers secure payment options, subscriptions, and in-app purchases, ensuring a safe and seamless experience for both creators and users.\n\nWith features like reviews, ratings, and curated collections, Google Play Store helps users make informed choices while discovering trending apps, new games, and essential tools. Whether for productivity, entertainment, or education, Google Play Store is the gateway to the Android ecosystem, connecting users to the apps and content that shape daily life.",
    "size": 100,
    "reviews": "65M",
    "ratingAvg": 4.5,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 27000000 }
    ]
  },
  {
    "id": 9,
    "image": "https://i.ibb.co.com/SX2BdGtL/chrome-1.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "description": "Google Chrome is a fast, secure, and reliable web browser designed to make online navigation simple and efficient. Its minimalist interface emphasizes speed, performance, and ease of use while supporting advanced features like tab management, syncing across devices, and customizable extensions.\n\nChrome integrates seamlessly with Google services, allowing users to access Gmail, Drive, Calendar, and more with a single account. Security is a key focus, with features like safe browsing, automatic updates, and phishing protection keeping users’ data safe.\n\nWith high-speed browsing, extensive developer tools, and support for modern web standards, Chrome caters to casual users, students, and professionals alike. Its combination of simplicity, reliability, and versatility makes it one of the most popular browsers in the world, enhancing how people interact with the web every day.",
    "size": 120,
    "reviews": "87M",
    "ratingAvg": 4.6,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 59000000 }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co.com/wryjydfc/Netflix.webp",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is a global streaming platform that delivers movies, TV shows, documentaries, and original content directly to users’ devices. With a vast library spanning every genre, Netflix allows users to watch what they want, when they want, without traditional broadcasting schedules. Personalized recommendations, curated collections, and trending lists help users discover new favorites based on viewing habits.\n\nSubscribers can create multiple profiles, download content for offline viewing, and enjoy high-definition streaming with adaptive bandwidth. Netflix originals and exclusive series have made it a cultural phenomenon, shaping entertainment trends worldwide.\n\nDesigned for flexibility and convenience, Netflix supports a wide range of devices from smartphones and tablets to smart TVs and gaming consoles. Whether for binge-watching, casual viewing, or discovering award-winning films, Netflix has transformed how audiences experience entertainment, offering endless stories at their fingertips.",
    "size": 130,
    "reviews": "65M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 39000000 }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co.com/b5DqfXRG/deepflow-1.png",
    "title": "FocusMate",
    "companyName": "DeepFlow Labs",
    "description": "Focusmate is a productivity app designed to boost accountability and deep work by connecting users with live, virtual work partners. Each session pairs individuals with others around the world, creating structured, distraction-free work blocks. Users set goals before each session and work alongside their partner in real time, fostering motivation and focus.\n\nThe app’s community-driven approach helps reduce procrastination, as knowing someone is working alongside you increases commitment to tasks. Focusmate also allows scheduling recurring sessions, tracking productivity streaks, and reflecting on progress over time.\n\nWhether for writing, studying, coding, or business tasks, Focusmate provides a digital accountability partner that transforms solitary work into a collaborative, productive experience. By combining structure, social presence, and goal-setting, Focusmate helps users work smarter, stay disciplined, and maintain consistent focus throughout the day.",
    "size": 52,
    "reviews": "16.4K",
    "ratingAvg": 4.8,
    "downloads": "3.2M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 9830 }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co.com/Lzk1GXV7/noteflow-inc-logo.jpg",
    "title": "NoteFlow",
    "companyName": "ThinkNote Inc",
    "description": "Noteflow is a versatile note-taking and productivity app designed to help users capture ideas, organize information, and manage tasks seamlessly. With features like rich text formatting, multimedia attachments, and customizable notebooks, Noteflow allows users to create notes that suit both professional and personal needs. Its intuitive interface ensures that users can quickly jot down thoughts, record meetings, or draft creative content without distractions.\n\nThe app supports tagging, search, and cross-device synchronization, so your notes are always accessible whether on a phone, tablet, or desktop. Collaborative tools allow teams to share notebooks, assign tasks, and provide feedback in real time, making Noteflow ideal for group projects, study sessions, and business planning.\n\nBy combining organization, flexibility, and collaboration, Noteflow transforms note-taking from a simple task into a productive workflow. Whether managing daily tasks, planning projects, or capturing creative ideas, Noteflow ensures that your thoughts are organized, easily retrievable, and actionable, helping you stay focused and efficient throughout the day.",
    "size": 44,
    "reviews": "10.5K",
    "ratingAvg": 4.6,
    "downloads": "870K",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2900 },
      { "name": "5 star", "count": 5000 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co.com/W48Gydpp/fittrack.jpg",
    "title": "FitTrack",
    "companyName": "WellBody Tech",
    "description": "FitTrack is a comprehensive health and fitness app that empowers users to monitor, analyze, and improve their well-being. It combines activity tracking, nutrition logging, and personalized workout plans to provide a holistic approach to health. Users can track steps, calories burned, sleep patterns, and heart rate while setting daily, weekly, or monthly goals to stay motivated.\n\nThe app also offers fitness assessments, progress charts, and tailored recommendations based on individual performance and lifestyle habits. With integration across wearable devices and smart scales, FitTrack provides accurate data and actionable insights that help users make informed decisions about their health.\n\nWhether you’re trying to lose weight, gain strength, or simply maintain a healthy lifestyle, FitTrack delivers the tools, guidance, and motivation needed to achieve your goals. Its easy-to-use interface, personalized plans, and detailed analytics make fitness tracking engaging, effective, and sustainable for everyone.",
    "size": 79,
    "reviews": "20K",
    "ratingAvg": 4.7,
    "downloads": "2.5M",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 4600 },
      { "name": "5 star", "count": 9750 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co.com/YnCv3kr/fingrow.png",
    "title": "FinGrow",
    "companyName": "MoneyHive",
    "description": "FinGrow is an all-in-one personal finance app designed to help users manage their money, track spending, and plan for the future. The app allows users to link bank accounts, credit cards, and investment portfolios, providing a comprehensive overview of their financial health. Advanced budgeting tools and expense categorization help users understand where their money is going and make smarter financial decisions.\n\nFinGrow also offers goal-setting features, reminders for bill payments, and insights into saving patterns. Its data-driven recommendations guide users toward achieving short-term and long-term financial objectives, such as building an emergency fund, investing, or reducing debt.\n\nDesigned for simplicity and security, FinGrow transforms personal finance from a stressful chore into a manageable, proactive process. With its intuitive interface, powerful analytics, and personalized insights, users can gain control over their finances, make informed choices, and build a stable financial future.",
    "size": 63,
    "reviews": "12.4K",
    "ratingAvg": 4.4,
    "downloads": "950K",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 5650 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co.com/hwg9fbh/workhub.jpg",
    "title": "WorkHub",
    "companyName": "Collabify Inc",
    "description": "WorkHub is a productivity and collaboration platform that streamlines communication, task management, and project tracking for teams of all sizes. Users can create projects, assign tasks, set deadlines, and monitor progress in real time, ensuring that everyone stays aligned and productive. The app supports chat, video calls, file sharing, and notifications, reducing the need for multiple tools and centralizing workflows in a single platform.\n\nWorkHub also provides dashboards, analytics, and reporting tools that give managers and team members insights into productivity, bottlenecks, and overall project health. Integration with popular software and cloud services further enhances workflow efficiency.\n\nBy combining task management, communication, and analytics, WorkHub transforms team collaboration into an organized, efficient, and transparent experience. Whether for startups, remote teams, or large enterprises, WorkHub ensures projects are completed on time and goals are consistently met.",
    "size": 92,
    "reviews": "19.8K",
    "ratingAvg": 4.3,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 3100 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 8000 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co.com/KjDgJmK1/mindease.png",
    "title": "MindEase",
    "companyName": "CalmSpace Studios",
    "description": "MindEase is a mental wellness and mindfulness app designed to help users manage stress, anxiety, and improve overall emotional well-being. It offers guided meditation sessions, breathing exercises, sleep aids, and mood tracking tools to support mental health in daily life. Users can customize programs based on personal needs, goals, and time availability, creating a flexible and personalized wellness routine.\n\nThe app also provides educational content on mental health topics, coping strategies, and cognitive exercises that promote resilience and focus. Progress tracking and reminders help users maintain consistency, reinforcing positive habits over time.\n\nWhether for managing daily stress, improving concentration, or establishing a regular mindfulness practice, MindEase combines practical tools and expert guidance. Its intuitive interface, structured exercises, and supportive resources make mental wellness accessible, helping users achieve balance, clarity, and emotional strength throughout their day.",
    "size": 58,
    "reviews": "9.8K",
    "ratingAvg": 4.9,
    "downloads": "702K",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 6100 }
    ]
  },
  {
    "id": 17,
    "image": "https://i.ibb.co.com/wZ55j9Sn/learnly.webp",
    "title": "Learnly",
    "companyName": "EduNova",
    "description": "Learnly is an educational app designed to make learning engaging, interactive, and accessible for users of all ages. It offers a wide range of courses, tutorials, and practice exercises across subjects such as math, science, languages, and arts. With personalized learning paths, adaptive quizzes, and progress tracking, Learnly ensures that users can study at their own pace and focus on areas that need improvement.\n\nThe app also incorporates gamified elements like achievements, badges, and leaderboards to motivate learners and make studying enjoyable. Collaborative features allow students to participate in group activities, discussions, and peer-to-peer learning, fostering a sense of community and shared growth.\n\nWhether for exam preparation, skill development, or lifelong learning, Learnly provides comprehensive tools and insights that empower users to achieve their educational goals. Its intuitive interface, diverse content, and structured programs create a seamless and effective learning experience, helping learners stay consistent, confident, and motivated.",
    "size": 66,
    "reviews": "18.4K",
    "ratingAvg": 4.7,
    "downloads": "130K",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 3700 },
      { "name": "5 star", "count": 9600 }
    ]
  },
  {
    "id": 18,
    "image": "https://i.ibb.co.com/MkdDMmjN/travelgo.png",
    "title": "TravelGo",
    "companyName": "JetWorld",
    "description": "TravelGo is a travel planning and discovery app designed to simplify every aspect of your journey. Users can search for destinations, book flights, accommodations, and experiences, and organize itineraries all in one place. The app offers personalized recommendations based on interests, travel history, and seasonal trends, helping users uncover hidden gems and must-see attractions.\n\nTravelGo also includes interactive maps, offline access, and real-time updates on weather, transportation, and local events, ensuring smooth navigation and a well-informed trip. Users can save favorite locations, share itineraries with friends, and read reviews from other travelers to make better decisions.\n\nWhether planning a weekend getaway or an international adventure, TravelGo combines convenience, inspiration, and reliability. Its comprehensive tools and insights allow travelers to optimize their time, explore confidently, and enjoy a seamless, memorable experience from start to finish.",
    "size": 88,
    "reviews": "15.3K",
    "ratingAvg": 4.5,
    "downloads": "170K",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 3400 },
      { "name": "5 star", "count": 7900 }
    ]
  }
]
